fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
		Движения.ВКМ_Удержания.Записывать = Истина;
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		
		Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
			
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
			Движение.ПериодРегистрации = Дата;
			Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
			Движение.Результат = ТекСтрокаСписокСотрудников.СуммаПремии;
			Движение.Регистратор = Ссылка;
			
			Движение = Движения.ВКМ_Удержания.Добавить();
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.Налог;
			Движение.ПериодРегистрации = Дата;
			Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
			Движение.Результат = ТекСтрокаСписокСотрудников.СуммаПремии * 0.13;
			Движение.Регистратор = Ссылка;
			
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
			Движение.Сумма = ТекСтрокаСписокСотрудников.СуммаПремии - (ТекСтрокаСписокСотрудников.СуммаПремии * 0.13);
			Движение.Период = Дата;
			Движение.Регистратор = Ссылка;
			
		КонецЦикла;
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли
